package com.ohgiraffers.exception.number;

public class Run {
    public static void main(String[] args) {

      //- 2 개의 정수를 입력받아, `checkDouble` 메소드로 전달하면서 실행함
        //- 리턴된 결과로 결과로 `"ooo의 배수입니다/배수가 아납니다."` 출력함.
        public void test(){}


        }
//[실행결과]
//------------ 예시 1 -------------------
//
//1에서 100사이의 정수를 하나 입력하세요 : 101
//1에서 100사이의 정수를 하나 입력하세요 : 1
//1부터 100사이의 값이 아닙니다.
//
//----------- 예시 2 ---------------------
//1에서 100사이의 정수를 하나 입력하세요 : 5
//1에서 100사이의 정수를 하나 입력하세요 : 14
//5는 14의 배수가 아닙니다.
//
//----------- 예시 3 ----------------------
//1에서 100사이의 정수를 하나 입력하세요 : 10
//1에서 100사이의 정수를 하나 입력하세요 : 2
//10는 2의 배수입니다.
}
